000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO.
000300 PROCEDURE DIVISION.
000400 000-MAIN.
000500     DISPLAY 'Hello, World!'
000600     END-DISPLAY.
000700     GOBACK.
